BAS BMEKZU Project/src/Enums/скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС/скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоКвитанциюОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПодтверждениеОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОтклонениеОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОтветОтДФС</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН/скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН</name>
  <registerRecords>InformationRegister.скEDI_ВипискиПоЛимитуРегистрацииВЕРНН</registerRecords>
  <attributes>
    <name>ОрганизацияEDI</name>
    <type>
      <types>CatalogRef.скEDI_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КтоОформилЗапрос</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклоненияДФС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыпискаСтрока2Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяОперация</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписи</name>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>CatalogRef.скEDI_Подписи</types>
        <types>CatalogRef.скEDI_ГруппыПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Подписано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодписиКонтрагента</name>
    <attributes>
      <name>ТелоСертификата</name>
      <comment>Base64-строка, построенная на основании двоичных данных файла сертификата</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>511</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.скEDI_РолиПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДРФОПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелоФаксимиле</name>
      <comment>Не используется</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>TSPСтатус</name>
      <type>
        <types>EnumRef.скEDI_TSPСтатус</types>
      </type>
    </attributes>
    <attributes>
      <name>OCSPСтатус</name>
      <type>
        <types>EnumRef.скEDI_OCSPСтатус</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/CommonModules/скEDI_НалоговыеДокументыПолучениеЛимитаРегистрацииВЕРНН/Module.bsl
Процедура скEDI_ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН(СтруктураПараметров) Экспорт
	Если не Константы.скEDI_ИспользованиеПодсистемы.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Если ТипЗнч(СтруктураПараметров) <> Тип("Структура") Тогда 
		
		ЗаписьЖурналаРегистрации("скEDI_ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН" ,,,,"Некорректный тип входящих параметров");
		Отказ = Истина;
		скEDI_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА: Некорректный тип входящих параметров");		
		
	Иначе	
		
		Если НЕ СтруктураПараметров.Свойство("Организация")
			ИЛИ НЕ ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда 
			
			ЗаписьЖурналаРегистрации("скEDI_ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН" ,,,,"Не заполнено свойство <Организация>");
			Отказ = Истина;
			скEDI_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА: Не заполнено свойство <Организация>");
			
		КонецЕсли;
		
		Если НЕ СтруктураПараметров.Свойство("НаименованиеФоновогоПроцесса")
			ИЛИ НЕ ЗначениеЗаполнено(СтруктураПараметров.НаименованиеФоновогоПроцесса) Тогда 
			
			ЗаписьЖурналаРегистрации("скEDI_ОтправкаЗапросаНаПолучениеЛимитаРегистрацииВЕРНН" ,,,,"Не заполнено свойство <НаименованиеФоновогоПроцесса>");
			Отказ = Истина;
			скEDI_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА: Не заполнено свойство <НаименованиеФоновогоПроцесса>");
			
		КонецЕсли;
		
		Если НЕ СтруктураПараметров.Свойство("ТаблицаНеобходимыхПодписейШифрования")
			ИЛИ СтруктураПараметров.ТаблицаНеобходимыхПодписейШифрования.Количество() = 0 Тогда 
			
			ЗаписьЖурналаРегистрации("скEDI_СверкаНалоговыхДокументовЕРНН" ,,,,"Не заполнено свойство <ТаблицаНеобходимыхПодписейШифрования>");
			Отказ = Истина;
			скEDI_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА: Не заполнено свойство <ТаблицаНеобходимыхПодписейШифрования>");
			
		КонецЕсли;
		
		Если НЕ СтруктураПараметров.Свойство("ТаблицаНеобходимыхПодписей")
			ИЛИ СтруктураПараметров.ТаблицаНеобходимыхПодписей.Количество() = 0 Тогда 
			
			ЗаписьЖурналаРегистрации("скEDI_СверкаНалоговыхДокументовЕРНН" ,,,,"Не заполнено свойство <ТаблицаНеобходимыхПодписей>");
			Отказ = Истина;
			скEDI_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА: Не заполнено свойство <ТаблицаНеобходимыхПодписей>");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ВыполняемыеОперации = Новый Массив;
	ВыполняемыеОперации.Добавить("Подпись");
	ВыполняемыеОперации.Добавить("ОтправкаВДФС");
	ТаблицаНастроекПодписей = СтруктураПараметров.ТаблицаНеобходимыхПодписей;
	ТаблицаНастроекПодписейШифрования = СтруктураПараметров.ТаблицаНеобходимыхПодписейШифрования;
	
	ДокументЗапросВЕРНН = Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.СоздатьДокумент();
	ДокументЗапросВЕРНН.ОрганизацияEDI = СтруктураПараметров.Организация;
	ДокументЗапросВЕРНН.Организация = ДокументЗапросВЕРНН.ОрганизацияEDI.Организация1С;
	ДокументЗапросВЕРНН.Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Создан;
	ДокументЗапросВЕРНН.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокументЗапросВЕРНН.Дата = ТекущаяДата();
	ДокументЗапросВЕРНН.УстановитьНовыйНомер();
	
	РезультатСозданияИОтправкиЗапроса = Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.ОбработатьЭлектронныйДокумент_Объект(ДокументЗапросВЕРНН, ВыполняемыеОперации, ТаблицаНастроекПодписей, ТаблицаНастроекПодписейШифрования);
	Если РезультатСозданияИОтправкиЗапроса <> Неопределено Тогда
		Сообщить("Запрос не отправлен." + Строка(РезультатСозданияИОтправкиЗапроса));
	КонецЕсли;
	
КонецПроцедуры
